           77 WRK-VALOR      PIC 9(06)V99       VALUE ZEROS.
           77 WRK-MESES      PIC 9(03)          VALUE ZEROS.
           77 WRK-TAXAMES    PIC 9(02)          VALUE ZEROS.
           77 WRK-VALOR-ED   PIC ZZZ.ZZ9,99     VALUE ZEROS.
